{
  "className":"swingtree.threading.Async_MVVM_Spec",
  "title":"Asynchronous MVVM",
  "narrative":"Swing only knows 1 thread, the Event Dispatch Thread (EDT)\n    which performs both the UIs rendering as well as event handling.\n    This is a problem for Swing applications that need to perform\n    long running tasks in the background, as the EDT will be blocked\n    until the task is complete.\n\n    SwingTree provides a mechanism for creating UIs which \n    dispatch events to a custom application thread as well as ensure that all UI related \n    operations are performed on the event dispatch thread!\n    Not only does this allow your applications to perform long running tasks\n    in the background without blocking the UI, it improves\n    the performance and responsiveness of you desktop application as a whole.\n\n    This specification demonstrates how this feature interacts with the MVVM pattern\n    and the binding of properties to UI components.",
  "subjects":["swingtree.UI","swingtree.EventProcessor","sprouts.Var"],
  "statistics":{
    "runs":"1",
    "successRate":"100.0%",
    "failures":"0",
    "errors":"0",
    "skipped":"0",
    "duration":"0.240 seconds"
  },
  "headers":[],"tags":{},"see":[],
  "features":[ 
    {
      "id":"The order in which the states of properties change is preserved when applied to the UI.",
      "result":"PASS",
      "duration":"0.238 seconds",
      "iterations":{
      "tags":{},"see":[],"extraInfo":["\n            MVVM in Swing-Tree is based on the observability built into the Sprouts property objects.\n            However, in a multi-threaded/asynchronous environment, the order in which the states of properties\n            change is not guaranteed to be preserved when applied to the UI.\n\n            Here a little explanation is in order:\n            Consider a property that is bound to a UI component, and that property is changed by the application thread.\n            This causes the property to notify its observers so that they can update the state of the UI component.\n            Because Swing-tree is asynchronous, the app thread will put the change procedure \n            in the event queue of the EDT, and the EDT will ultimately apply the change to the UI.\n            However, it might take a while before the EDT gets around to processing the event\n            and until then the property might have changed again!\n            In fact, the state of the property can change multiple times before the EDT\n            gets a chance to apply them to the UI. \n            The problem that might arise is that the sequence of changes in the UI is not the same as the sequence\n            in which the changes were made to the property.\n\n            Swing-Tree provides a mechanism for ensuring that the order in which the states of properties\n            change is preserved when applied to the UI.\n        "]
      },
      "blocks":[
        {"kind":"given","text":"We create a simple property storing a String.","code":["var property = Var.of(\"Hello\")"]},

        {"kind":"and","text":"A mocked JLabel, which we will use to verify the order in which the states of the property are applied to the UI.","code":["var label = Mock(JLabel)"]},

        {"kind":"and","text":"We create a Swing thread decoupled UI component that is bound to the property.","code":["var node = UI.use(EventProcessor.DECOUPLED,","                           ()-> UI.of(label).withText(property)","                           )"]},

        {"kind":"when","text":"We simply change the property once...","code":["property.set(\"Hi\")"]},

        {"kind":"and","text":"Sync with the AWT thread...","code":["UI.sync()"]},

        {"kind":"then","text":"As expected, the UI component is changed to the new value of the property.","code":["1 * label.setText(\"Hi\")"]},

        {"kind":"when","text":"We do 4 changes in a row...","code":["property.set(\"Hello\")","property.set(\"Hi\")","property.set(\"Hey\")","property.set(\"Hi\")"]},

        {"kind":"and","text":"Sync with the AWT thread again...","code":["UI.sync()"]},

        {"kind":"then","text":"All changes will be applied to the UI in the order in which they were made to the property.","code":["1 * label.setText(\"Hello\")","1 * label.setText(\"Hi\")","1 * label.setText(\"Hey\")","1 * label.setText(\"Hi\")"]}
      ],
      "problems":{"dataValues":[], "errors":[]}
    }
  
  ],
  "generator":"https://github.com/renatoathaydes/spock-reports"
}